Revit 2024 API
IFCExportElementType Enumeration
 An enumerated type defining if an element type is exported to IFC or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum IFCExportElementType
Visual Basic
Public Enumeration IFCExportElementType
Visual C++
public enum class IFCExportElementType
Members
Member name | Description
Default |  Export element type to IFC according to category or Revit element settings.
Yes |  Export element type to IFC regardless of category or Revit element settings.
No |  Don't export element type to IFC regardless of category or Revit element settings.
See Also
Autodesk.Revit.DB Namespace